package lr4;

public class Example1 {
    public static void main(String[] args) {
        int y = 23; // Ширина
        int z = 11; // Высота
        for (int i = 1; i <= z; i++ ){
            for (int e = 1; e <= y; e++){
                System.out.print("+");
            }
            System.out.print("\n");

        }

    }
}
/*

1. Напишите программу, которая выводить в консольное окно
        прямоугольник, размеры сторон которого, ширина: 23 колонки, высота: 11
        строк;*/
