package lr4;

public class Example6 {
    public static void main(String[] args) {
        int str = 10;
        int row = 10;
        int[][] arr1 = new int[str][row];

    }
}

/*
6. Напишите программу, в которой создается и инициализируется двумерный числовой массив.
Затем из этого массива удаляется строка и столбец (создается новый массив, в котором по сравнению с исходным удалена одна строка и один столбец).
Индекс удаляемой строки и индекс удаляемого столбца определяется с помощью генератора случайных чисел.
*/
